In [ ]:
import sqlite3
from sqlite3 import Error
import pandas as pd

conn = None
try:
    conn = sqlite3.connect('ejemplo.db')
except Error as e:
    print(e)

cur = conn.cursor()
cur.execute('SELECT * FROM empleado;')
# rows = cur.fetchall()

# for row in rows:
#     print(row)

cols = [column[0] for column in cur.description]
df_emp = pd.DataFrame.from_records(data=cur.fetchall(), columns = cols)
df_emp

In [5]:
df_emp.shape

(3, 3)

In [6]:
df_emp.describe()

        id
count  3.0
mean   2.0
std    1.0
min    1.0
25%    1.5
50%    2.0
75%    2.5
max    3.0

In [7]:
df_emp.tail()

   id     nombre                 correo
0   1  Francisco  correo1@miempresa.com
1   2      Pedro  correo2@miempresa.com
2   3       Rosa  correo3@miempresa.com